var title = document.getElementById('title');
var topMusicControlAudio = document.getElementById('topMusicControlAudio');
var i = 0;
function parseLyric(text) {
    lyric = text.split('\r\n'); //先按行分割
    var _len = lyric.length; //获取歌词行数
    lrc = new Array(); //新建一个数组存放最后结果
    for (i = 0; i < _len; i++) {
        // console.log(lyric[i]);
        var d = lyric[i].match(/\[\d{2}:\d{2}((\.|\:)\d{2})\]/g);  //正则匹配播放时间
        var str = lyric[i].match(/{(\S*)}/g);
        var t = lyric[i].match(/}(\S*)/g); //以时间为分割点分割每行歌词，数组最后一个为歌词正文
    }
    lrc.push(d);
    lrc.push(str);
    lrc.push(t);
    return lrc;
}
function music() {
    /**
     * 将歌词中的时间转化为歌曲时间
     */
    var musicTime = topMusicControlAudio.currentTime.toFixed(2);
    var time = lrc[0];
    time = time[i].substring(1, time[i].length-1);
    time = 60*Number(time.substring(0,2)) + parseFloat(time.substring(3, 7));
    console.log(musicTime);
    console.log(time);
    if (time -musicTime <= 0.15){
    title.innerHTML = '<h1 style="text-align: center">'+lrc[1][i].substring(1, lrc[1][i].length-1)+'</h1><br><h5 style="text-align: center">' + lrc[2][i].substring(1, lrc[2][i].length) + '</h5>';
        i++;
    }  
    else{
        console.log(musicTime);
    } 
}
var text = `[ti:生僻字] 
[ar:陈柯宇] 
[al:] 
[by:onEmue] 

[00:00.00]{}陈柯宇 - 生僻字
[00:02.00]{}词：陈柯宇
[00:04.00]{}曲：陈柯宇
[00:06.00]{}游戏改编&nbsp;亦木
[00:08.00]{}
[00:13.00]{}    
[00:15.00]{}   
[00:16.55]{}我们中国的汉字
[00:18.14]{}落笔成画留下五千年的历史
[00:21.40]{}让世界都认识
[00:23.26]{}我们中国的汉字
[00:24.99]{}一撇一捺都是故事
[00:29.81]{}
[00:37.96]{}跪举火把虔诚像道光
[00:40.35]{}四方田地落谷成仓
[00:44.45]{}古人象形声意辨恶良
[00:47.14]{}魃魈魁鬾魑魅魍魉
[00:51.17]{}Wu~又双叒叕
[00:54.54]{}Wu~火炎焱燚
[00:57.85]{}Wu~水沝淼㵘
[01:01.03]{}㙓~
[01:04.34]{}
[01:04.88]{88267754}茕茕孑立&nbsp;沆瀣一气
[01:06.48]{66547756}踽踽独行&nbsp;醍醐灌顶
[01:08.29]{99563256}绵绵瓜瓞&nbsp;奉为圭臬
[01:09.97]{72665496}龙行龘龘&nbsp;犄角旮旯
[01:11.75]{36524659}娉婷袅娜&nbsp;涕泗滂沱
[01:13.68]{99565253}呶呶不休&nbsp;不稂不莠
[01:17.11]{}卬~
[01:18.49]{45855652}咄嗟&nbsp;蹀躞&nbsp;耄耋&nbsp;饕餮
[01:20.36]{75955153}囹圄&nbsp;蘡薁&nbsp;觊觎&nbsp;龃龉
[01:22.03]{25967412}狖轭鼯轩&nbsp;怙恶不悛
[01:23.71]{96523654}其靁虺虺&nbsp;腌臢孑孓
[01:25.65]{85471236}陟罚臧否&nbsp;针砭时弊
[01:27.41]{96652345}鳞次栉比&nbsp;一张一翕
[01:31.94]{}我们中国的汉字
[01:33.40]{}落笔成画留下五千年的历史
[01:36.80]{}让世界都认识
[01:38.56]{}我们中国的汉字
[01:40.29]{}一撇一捺都是故事
[01:45.64]{}现在全世界各地
[01:47.13]{}到处有中国字
[01:48.85]{}黄皮肤的人骄傲地把头抬起
[01:52.55]{}我们中国的汉字
[01:53.99]{}一平一仄谱写成诗
[01:58.94]{}
[02:16.72]{88267754}茕茕孑立&nbsp;沆瀣一气
[02:18.57]{66547756}踽踽独行&nbsp;醍醐灌顶
[02:20.28]{99563256}绵绵瓜瓞&nbsp;奉为圭臬
[02:21.99]{72665496}龙行龘龘&nbsp;犄角旮旯
[02:23.59]{36524659}娉婷袅娜&nbsp;涕泗滂沱
[02:25.54]{99565253}呶呶不休&nbsp;不稂不莠
[02:28.97]{}卬~
[02:30.52]{45855652}咄嗟&nbsp;蹀躞&nbsp;耄耋&nbsp;饕餮
[02:32.35]{75955153}囹圄&nbsp;蘡薁&nbsp;觊觎&nbsp;龃龉
[01:22.03]{25967412}狖轭鼯轩&nbsp;怙恶不悛
[02:33.93]{96523654}狖轭鼯轩&nbsp;怙恶不悛
[02:35.60]{85471236}其靁虺虺&nbsp;腌臢孑孓
[02:37.44]{85471236}陟罚臧否&nbsp;针砭时弊
[02:39.25]{96652345}鳞次栉比&nbsp;一张一翕
[02:43.87]{}我们中国的汉字
[02:45.39]{}落笔成画留下五千年的历史
[02:48.78]{}让世界都认识
[02:50.60]{}我们中国的汉字
[02:52.18]{}一撇一捺都是故事
[02:57.57]{}现在全世界各地
[02:59.21]{}到处有中国字
[03:00.80]{}黄皮肤的人骄傲地把头抬起
[03:04.39]{}我们中国的汉字
[03:05.96]{}一平一仄谱写成诗
[03:10.84]{}优美旋律自宫商角徵羽
[03:17.56]{}众人皆说成之于语故成语
[03:25.58]{}`
var a = parseLyric(text);

// console.log(a)